{
  "backend/main.mo": "Defines actor with access control, data types, and CRUD logic for user profiles, coping mechanisms, check-ins, journal entries, and saved items.",
  "feature_evidence.json": "Reports feature-to-file mappings and metadata for implemented app features, tests, and components.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose of each frontend file for documentation or planning.",
  "frontend/index.css": "Defines Tailwind base styles and custom OKLCH-based color tokens for light and dark themes.",
  "frontend/index.html": "Basic HTML shell that loads the React app entry point into the root div.",
  "frontend/src/App.tsx": "Sets up global theme provider and full TanStack Router configuration for all app routes.",
  "frontend/src/components/AppLayout.tsx": "Wraps pages with navigation, footer, and optional profile setup modal based on user authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "A login/logout button that triggers Internet Identity authentication and clears queries on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "A modal prompting the user to enter and save a display name via a profile mutation.",
  "frontend/src/components/auth/RequireAuth.tsx": "A wrapper that blocks access unless the user is authenticated, showing a sign‑in card otherwise.",
  "frontend/src/components/Footer.tsx": "Renders footer with attribution link, heart icon, and medical disclaimer text.",
  "frontend/src/components/PrimaryNav.tsx": "Implements responsive navigation bar with desktop and mobile menus, icons, and user greeting.",
  "frontend/src/content/libraryTopics.ts": "Static content defining educational library topics with structured sections and bullet points.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication and login state.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, coping mechanisms, prompts, check-ins, and journal entries via the actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and global styles.",
  "frontend/src/main.tsx": "Application entry that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/CheckIn/CheckInDetailPage.tsx": "Displays details for a single daily check-in, including scores and notes, with loading and not‑found states.",
  "frontend/src/pages/CheckIn/CheckInPage.tsx": "Provides a form to submit a new daily check-in and lists previous check-ins sorted by date.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page hero section and feature grid linking to major app sections.",
  "frontend/src/pages/Journal/JournalPage.tsx": "Allows users to create new journal entries using optional prompts and view their saved entries.",
  "frontend/src/pages/Library/LibraryListPage.tsx": "Shows a list of educational library topics with a disclaimer and links to topic details.",
  "frontend/src/pages/Library/TopicDetailPage.tsx": "Displays detailed content for a library topic and lets signed‑in users save it.",
  "frontend/src/pages/Saved/SavedPage.tsx": "Displays saved coping mechanisms and topics, handling unauthenticated states and loading conditions.",
  "frontend/src/pages/Toolkit/ToolkitDetailPage.tsx": "Shows detailed information about a coping mechanism, including save functionality and evidence indicators.",
  "frontend/src/pages/Toolkit/ToolkitListPage.tsx": "Lists coping mechanisms with category filtering, loading states, and navigation to detail pages.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, fonts, animations, and content scanning paths.",
  "project_state.json": "Tracks project metadata, required images, and a list of implemented features for an app supporting ADHD women in perimenopause. Contains project versioning, design requirements, and feature definitions for navigation, UI theme, toolkit, topics, check-ins, and journaling."
}